org/trigger_list.org
:PROPERTIES:
:ID:       fcf813a5-3872-4b9b-b5c8-19b885b9623b
:END:
#+title: Trigger List
* Trigger List
Use this trigger list to recall items that are need require action:

- Projects started, not completed
- Projects that need to be started
- Commitments/promises to others
  - Teachers/TAs
  - Roommates
  - Classmates
  - Friends
  - "Outside" people
    - Parents
    - Campus organizations
    - Extracurricular organizations
    - Graduates
- Communications to make/get
  - Internal/External
    - Initiate or respond to:
      - Phone calls
      - Text messages
      - Voice-mail
      - E-mail
      - Snail mail
      - Social Media
  - Other writing to finish/submit
    - Reports
    - Papers
    - Reviews
    - Assignments
    - Articles
    - Readings
    - Rewrites and edits
- Meetings that need to be set/requested
- Waiting for...
  - Information
  - Delegated tasks/projects
  - Completions critical to projects
- Replies to:
  - Texts
  - Calls
  - Decisions of others

