docs/trigger_list.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-15 Wed 12:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Trigger List</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jethro Kuan" />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Trigger List</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0ab41ff">1. Trigger List</a></li>
</ul>
</div>
</div>
<div id="outline-container-org0ab41ff" class="outline-2">
<h2 id="org0ab41ff"><span class="section-number-2">1</span> Trigger List</h2>
<div class="outline-text-2" id="text-1">
<p>
Use this trigger list to recall items that are need require action:
</p>

<ul class="org-ul">
<li>Projects started, not completed</li>
<li>Projects that need to be started</li>
<li>Commitments/promises to others
<ul class="org-ul">
<li>Teachers/TAs</li>
<li>Roommates</li>
<li>Classmates</li>
<li>Friends</li>
<li>"Outside" people
<ul class="org-ul">
<li>Parents</li>
<li>Campus organizations</li>
<li>Extracurricular organizations</li>
<li>Graduates</li>
</ul></li>
</ul></li>
<li>Communications to make/get
<ul class="org-ul">
<li>Internal/External
<ul class="org-ul">
<li>Initiate or respond to:
<ul class="org-ul">
<li>Phone calls</li>
<li>Text messages</li>
<li>Voice-mail</li>
<li>E-mail</li>
<li>Snail mail</li>
<li>Social Media</li>
</ul></li>
</ul></li>
<li>Other writing to finish/submit
<ul class="org-ul">
<li>Reports</li>
<li>Papers</li>
<li>Reviews</li>
<li>Assignments</li>
<li>Articles</li>
<li>Readings</li>
<li>Rewrites and edits</li>
</ul></li>
</ul></li>
<li>Meetings that need to be set/requested</li>
<li>Waiting for&#x2026;
<ul class="org-ul">
<li>Information</li>
<li>Delegated tasks/projects</li>
<li>Completions critical to projects</li>
</ul></li>
<li>Replies to:
<ul class="org-ul">
<li>Texts</li>
<li>Calls</li>
<li>Decisions of others</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jethro Kuan</p>
<p class="date">Created: 2018-08-15 Wed 12:12</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
